<template>
	<view style="background-color: #fefefe;">
		<view class="" style="height: 30rpx;"></view>
		<view class="" style=""><p style="font-size: 48rpx;text-align: center;margin: 0rpx 0rpx 30rpx 0rpx;">隐私政策</p></view>
		<view class="" style="font-size: 34rpx;padding: 0rpx 40rpx;text-indent: 2em;letter-spacing: 4rpx;">
			<p>生效日期: 2020年6月15日</p>
			<p>更新日期: 2020年6月15日</p>
			<p>
				欢迎使用河南碧浩网络科技有限公司提供的产品和服务!河南碧浩网络科技有限公司(或简称“我们”)深知个人信息对您的重要性，我们一向庄严承诺保护使用我们的产品和服务(以下统称“碧浩科技服务&quot;)之用户(以下统称“用户“或“您&quot;)的个人信息及隐私安全。您在使用碧浩科技服务时,我们可能会收集和使用您的相关个人信息(或简称&quot;个人信息&quot;)。
			</p>
			<p>
				《隐私政策》适用于我们提供的所有碧浩科技服务。当您使用我们任何单项服务时，您同意接受本《隐私政策》以及我们在该单项服务中发出的特定隐私信息类政策条款(下列称“特定条款&quot;)的保护，在此情况下特定条款与本《隐私政策》条款同时对您产生效力，未满十八周岁的用户，同时适用本《隐私政策》以及《未成年人个人信息保护规则及监护人须知》。如特定条款与本《隐私政策》条款存在同类条款的不一致约定，则在特定条款约束范围内应以特定条款为准。如我们提供的某一单项服务不适用本《隐私政策》的，该服务中会以适当方式明示排除适用本《隐私政策》。
			</p>
			<p>
				我们希望通过本《隐私政策》向您说明我们在收集和使用您相关个人信息时对应的处理规则，以及我们为您提供的访问、更正、删除和保护这些个人信息的方式，以便更好的保障您的权益。
			</p>
			<p>
				[特别提示]请您在使用碧浩科技服务前，仔细阅读(未成年人请在监护人陪同下阅读)并了解本《隐私政策》及《未成年人个人信息保护规则及监护人须知》,以做出适当选择。一旦您使用或在我们更新本《隐私政策》后继续使用我们的产品或服务，即意味着您同意本《隐私政策》并同意我们按照本《隐私政策》收集、使用、储存、分享、转让和披露您的相关个人信息。
			</p>
			<p>本《隐私政策》将帮助您了解以下内容: .</p>
			<h4>一、我们如何收集和使用您的个人信息</h4>
			<h4>二、我们如何使用COOKIES或同类技术</h4>
			<h4>三、我们可能分享、转让和披露的个人信息</h4>
			<h4>四、我们如何保留、储存和保护您的个人信息安全</h4>
			<h4>五、如何管理您的个人信息</h4>
			<h4>六、第三方服务</h4>
			<h4>七、未成年人保护</h4>
			<h4>八、通知和修订</h4>
			<h4>九、如何联系我们</h4>
			<h3>一、 我们如何收集和使用您的个人信息</h3>
			<p>我们收集您的个人信息主要是为了您和其他用户能够更容易和更满意地使用碧浩科技服务。而这些个人信息有助于我们实现这一目标。</p>
			<p>(一)我们将通过以下途径收集和获得您的个人信息:</p>
			<p>1、您提供的个人信息。</p>
			<p>(1)您在注册碧浩科技服务的帐号或使用碧浩科技服务时，向我们提供的个人信息;</p>
			<p>(2)您通过碧浩科技服务向其他方提供的共享个人信息，以及您使用碧浩科技服务时所储存的个人信息。</p>
			<p>
				请注意，如您在碧浩科技服务中其他用户可见的公开区域内上传或发布的个人信息中、您对其他人上传或发布的信息作出的回应中公开您的个人信息，该等个人信息可能会被他人收集并加以使用。当您发现他人不正当地收集或使用您的个人信息时，您可以通过本《隐私政策》第九条[如何联系我们]约定的联系方式联络我们。
			</p>
			<p>一般情况下，我们将在收到您的问题、意见或建议之日起十五天内予以回复。</p>
		</view>
		<view class="" style="height: 300rpx;"></view>
		<button type="default" @click="testApi()">接口测试</button>
	</view>
</template>

<script>
import { testApi } from '../../apis/test.js';

export default {
	data() {
		return {};
	},
	methods: {
		testApi() {
			testApi()
				.then(res => {
					console.log(res.result);
				})
				.catch(er => {
					console.log(er);
				});
		}
	},
	onLoad() {
		uni.getStorage({
			key: 'aaa',
			success(res) {
				console.log(res.data);
			}
		}),
			uni.chooseImage({
				count: 6, //默认9
				sizeType: ['original', 'compressed'], //可以指定是原图还是压缩图，默认二者都有
				sourceType: ['album'], //从相册选择
				success: function(res) {
					console.log(JSON.stringify(res.tempFilePaths));
				}
			});
	}
};
</script>

<style></style>
